{
    content: ['B.S. Native Girl (Brenda Smith) is a member of the Port Gamble S’Klallam tribe. Born in 1974, she was raised by her mother Juanita Roberts, Colville member. Her father Phil Finton non-tribal. Though he has the touch of being artistic and teaching his daughters.', 'Brenda enjoyed painting classes with her father as a young girl. Around the age of 17 her father taught her how to chainsaw carve, she loved to carve bears, benches, and tried a few eagles as well. After a time, Brenda steered her art passion towards tribal art. She began to google artists, learning as much as she could from the internet. She would gaze into photos of masterpieces and study the cuts, shapes, read meanings. Take in as much as she could.', 'Brenda decided to enroll as a full-time student at Northwest Indian College (NWIC) while working full time at a local casino. Brenda furthered her education in Tribal Probation, Casino Management along with taking weaving, tool-making, and carving classes. She used those skills to start making many more art pieces. Brenda gifted many of her art pieces for celebrations, birthdays any holiday. Brenda was always one to make something special for that special someone. Her art seemed to catch the eye of many sold mostly through word of mouth and friends of friends, then came the internet. She seemed to have done very well in the last few years making over 1000 new pieces in a year, with most finding new homes.', 'Approximately 2005 Brenda was commissioned for a 15’ totem pole. After she submitted her design and was chosen by the Port Gamble Tribes committee, Brenda was eager to start and complete her very first commissioned totem pole. Months of carving, putting her heart and soul into every detail the Totem pole was completed and delivered. Unfortunately, the totem was never raised and while being stored it was damaged. Years later Brenda was commissioned to repair the original totem. After bringing the totem to her workshop, Brenda quickly realized the damage was going to cause her to change the whole design, from the rotten wood, to the deep cracks and broken off pieces. Heartbroken, Brenda took the totem from her last art piece to what looked as a new log. Brenda came up with a new design that seemed to fit perfectly with the story that would be told at the ceremony when risen. The restored/designed totem was completed 2015, it is being stored on the reservation at Brenda’s workshop until the tribe decides when they are going to have the raising of the totem ceremony.'];
}